# CannotCreateFreeFormSetDueToShortBar Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..CannotCreateFreeFormSetDueToShortBar Property
BuiltInFailures..::..RebarFailures Class See Also
---
Cannot create the rebar set using the current references because at least one bar is below the minimum allowed length. Edit the covers and extents of the set and try the desired layout options again.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateFreeFormSetDueToShortBar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateFreeFormSetDueToShortBar As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateFreeFormSetDueToShortBar {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace